DataProcessors/umk_УсановкаПлановыхЦенПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>umk_УсановкаПлановыхЦенПродукции</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДополнительный</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсходнойПроводки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратТекущегоМесяца</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

InformationRegisters/СчетаУчетаНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>СчетаУчетаНоменклатуры</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СчетУчетаБУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаЗабалансовыйБУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаПередачиБУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаПередачиЗабалансовыйБУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СхемаРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СхемыРеализации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалоговоеНазначениеДоходовИЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьСтатьяПриростаУбылиЗапасов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиНалоговыхДеклараций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьУчитыватьКакЗапасНУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСклада</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСкладов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/umk_УсановкаПлановыхЦенПродукции/Ext/ObjectModule.bsl
Процедура УстановитьПлановыеЦены()Экспорт
	
	НачатьТранзакцию();
	
	// Таблица мат. затрат
	Запрос = Новый Запрос("ВЫБРАТЬ
		|	ВложенныйЗапрос.Ссылка КАК Ссылка,
		|	ВложенныйЗапрос.Продукция,
		|	ВложенныйЗапрос.КоличествоПродукции,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.КоличествоПродукции = 0
		|			ТОГДА 0
		|		ИНАЧЕ СУММА(ХозрасчетныйОборотыДтКт.СуммаОборот) / ВложенныйЗапрос.КоличествоПродукции
		|	КОНЕЦ КАК Цена,
		|	ХозрасчетныйОборотыДтКт.СуммаОборот КАК СуммаОборот
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&ДатаНачала, &ДатаОкончания, Регистратор, СчетДт В ИЕРАРХИИ (&Счет23), , , , ) КАК ХозрасчетныйОборотыДтКт
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ТребованиеНакладная.umk_Продукция КАК Продукция,
		|			ТребованиеНакладная.umk_КоличествоПродукции КАК КоличествоПродукции,
		|			ТребованиеНакладная.Ссылка КАК Ссылка
		|		ИЗ
		|			Документ.ТребованиеНакладная КАК ТребованиеНакладная
		|		ГДЕ
		|			ТребованиеНакладная.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			И ТребованиеНакладная.Проведен = ИСТИНА) КАК ВложенныйЗапрос
		|		ПО ХозрасчетныйОборотыДтКт.Регистратор = ВложенныйЗапрос.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Продукция,
		|	ВложенныйЗапрос.КоличествоПродукции,
		|	ВложенныйЗапрос.Ссылка,
		|	ХозрасчетныйОборотыДтКт.СуммаОборот
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка");
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("Счет23", ПланыСчетов.Хозрасчетный.Производство);
	
	ТаблицаМатЗатрат = Запрос.Выполнить().Выгрузить();
	
	// Установим фактические цены Для Выпуска продукции
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ОтчетПроизводстваЗаСмену.Ссылка
		|ИЗ
		|	Документ.ОтчетПроизводстваЗаСмену КАК ОтчетПроизводстваЗаСмену
		|ГДЕ
		|	ОтчетПроизводстваЗаСмену.ПометкаУдаления = ЛОЖЬ
		|	И ОтчетПроизводстваЗаСмену.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания");
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Продукция = ДокОбъект.Продукция;
		
		УстановитьЦену(Продукция, ТаблицаМатЗатрат, Выборка.Ссылка);
		
		РежимЗаписи = ?(ДокОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись);
		
		ДокОбъект.Записать(РежимЗаписи);
		
		Состояние(ДокОбъект.ссылка);
		
	КонецЦикла;
	
	#Если Клиент Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос("Сохранить изменения документов в базе?", Режим, 0);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
		КонецЕсли;
	#Иначе
		ЗафиксироватьТранзакцию();
	#КонецЕсли

	
КонецПроцедуры

Процедура УстановитьЦену(Продукция, ТаблицаМатЗатрат, Ссылка)
	
	Стоимость_91_на_кг = ПолучитьСтоимостьОПРНаЕдПродукции();
	
	Для Каждого СтрокаТЧ Из Продукция Цикл
		
		Параметры = Новый Структура("Продукция", СтрокаТЧ.Номенклатура);
		СтрокиПоиска = ТаблицаМатЗатрат.НайтиСтроки(Параметры);
		
		Если СтрокиПоиска.Количество() = 0 Тогда
			Сообщить("Не найдена стоимость для продукции: " + Строка(СтрокаТЧ.Номенклатура) + " в строке: " +  Строка(СтрокаТЧ.НомерСтроки) +
			" документа: " + Строка(Ссылка), СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;
			
		СтрокаТЧ.ПлановаяСтоимость =  СтрокиПоиска[0].Цена;
		СтрокаТЧ.ПлановаяСтоимостьУпр = СтрокиПоиска[0].Цена;
		
		СтрокаТЧ.СуммаПлановая = СтрокаТЧ.Количество * (СтрокаТЧ.ПлановаяСтоимость + ?(СтрокаТЧ.Счет = ПланыСчетов.Хозрасчетный.Полуфабрикаты
		Или СтрокаТЧ.Счет = ПланыСчетов.Хозрасчетный.СырьеИМатериалы , 0, Стоимость_91_на_кг));
		СтрокаТЧ.СуммаПлановаяУпр = СтрокаТЧ.Количество * (СтрокаТЧ.ПлановаяСтоимость + ?(СтрокаТЧ.Счет = ПланыСчетов.Хозрасчетный.Полуфабрикаты
		Или СтрокаТЧ.Счет = ПланыСчетов.Хозрасчетный.СырьеИМатериалы , 0, Стоимость_91_на_кг));
				
	КонецЦикла;
	
	
КонецПроцедуры

Функция ПолучитьСтоимостьОПРНаЕдПродукции()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХозрасчетныйОборотыДтКт.СуммаОборот,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.umk_КоличествоПродукции = 0
		|			ТОГДА 0
		|		ИНАЧЕ ХозрасчетныйОборотыДтКт.СуммаОборот / ВложенныйЗапрос.umk_КоличествоПродукции
		|	КОНЕЦ КАК ОпрНаЕд,
		|	ВложенныйЗапрос.umk_КоличествоПродукции КАК umk_КоличествоПродукции
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&НачалоПериода, &ОкончаниеПериода, Месяц, СчетДт = &Счет91, , НЕ СчетКт = &Счет91, , ) КАК ХозрасчетныйОборотыДтКт,
		|	(ВЫБРАТЬ
		|		СУММА(ТребованиеНакладная.umk_КоличествоПродукции) КАК umk_КоличествоПродукции
		|	ИЗ
		|		Документ.ТребованиеНакладная КАК ТребованиеНакладная
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СчетаУчетаНоменклатуры КАК СчетаУчетаНоменклатуры
		|			ПО ТребованиеНакладная.umk_Продукция = СчетаУчетаНоменклатуры.Номенклатура
		|	ГДЕ
		|		ТребованиеНакладная.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|		И ТребованиеНакладная.Проведен = ИСТИНА
		|		И НЕ СчетаУчетаНоменклатуры.СчетУчетаБУ = &СчетУчетаБУ_25) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ХозрасчетныйОборотыДтКт.СуммаОборот,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.umk_КоличествоПродукции = 0
		|			ТОГДА 0
		|		ИНАЧЕ ХозрасчетныйОборотыДтКт.СуммаОборот / ВложенныйЗапрос.umk_КоличествоПродукции
		|	КОНЕЦ,
		|	ВложенныйЗапрос.umk_КоличествоПродукции";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ДатаНачала));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецМесяца(ДатаНачала));
	Запрос.УстановитьПараметр("Счет91", ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы);
	Запрос.УстановитьПараметр("СчетУчетаБУ_25", ПланыСчетов.Хозрасчетный.Полуфабрикаты);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ОпрНаЕд
	
	
КонецФункции
